Revit 2026 API

# FamilyGetFamilyTypeParameterValues Method

---

Returns all applicable values for a FamilyType parameter of this family.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ISet<ElementId> GetFamilyTypeParameterValues(
	ElementId parameterId
)
```
```vb
Public Function GetFamilyTypeParameterValues (
	parameterId As ElementId
) As ISet(Of ElementId)
```
```cpp
public:
ISet<ElementId^>^ GetFamilyTypeParameterValues(
	ElementId^ parameterId
)
```
```fsharp
member GetFamilyTypeParameterValues :
        parameterId : ElementId -> ISet<ElementId>
```

#### Parameters

parameterId ElementId
     A valid Id of a FamilyType parameter defined for this family.

#### Return Value

ISetElementId Ids of all applicable ElementType and NestedFamilyTypeReference elements.

| Exception | Condition |
| --- | --- |
| ArgumentException | The given parameterId does not represent a valid FamilyType parameter of this family. |
| ArgumentNullException | A non-optional argument was null |

The values are Element Ids of all family types that match the category specified by the definition of the given parameter. The elements are either of class ElementType or NestedFamilyTypeReference. The second variant is for the types that are nested in families and thus are not accessible otherwise.

If there are no applicable types of such category the returned collection will be empty.

#### Reference

Family Class

Autodesk.Revit.DB Namespace